import asyncio
from telethon import TelegramClient
from telethon.tl.functions.messages import SendMessageRequest
from telethon.tl.functions.account import UpdateProfileRequest
from telethon.errors import FloodWaitError

# --- твои данные --- ид,хеш, номер #КТО ТАКОЙ ЗАХАР АВАНГАРД по вопросам скрипта или ели захотите чтобы я удалил скрипт или помог устранить дыры или сделать новый скрипт  @kirilmachine
accounts = [
    {
        "api_id": ,  # замени на свой api_id
        "api_hash": '',  # замени на свой api_hash
        "phone": '+',  # замени на свой номер телефона c +
        "session_name": 'my_telegram_session'  # имя файла сессии
    },
    # Добавьте больше аккаунтов в этом формате
]

# Список ботов, сообщений и задержек ботов можно добавлять дюое количетво как и акков
bots_and_messages = [
    {
        "username": "valyutaTG_bot",  # имя первого бота без @
        "message": "🎁Бонус от первого бота",
        "delay":  86400  # задержка в секундах 1 день
    },
    {
        "username": "secondBot",  # имя второго бота без @
        "message": "🎉Сообщение для второго бота",
        "delay":  86400 # задержка в секундах 1 день
    },
    {
        "username": "thirdBot",  # имя третьего бота без @
        "message": "💌Сообщение для третьего бота",
        "delay":  14400  # задержка в секундах 4 часа 
    }
]

async def main():
    for account in accounts:
        client = TelegramClient(account["session_name"], account["api_id"], account["api_hash"])
        await client.start(phone=account["phone"])
        print(f"Клиент запущен для: {account['phone']}")

        # Проверяем, что аккаунт работает
        me = await client.get_me()
        print(f"Авторизован как: {me.first_name}")

        # Изменяем имя и описание профиля,там где нас нет всегда лучший минет
        new_name = "Захар Авангард"  # Задайте новое имя
        new_about = "@IrisAdvanceChat - первый игровой бот, в котором играешь ирисками 🍬"  # Задайте новое описание
        await client(UpdateProfileRequest(first_name=new_name, about=new_about))
        print(f"Имя и описание обновлены для: {me.first_name}")

        while True:
            for bot in bots_and_messages:
                try:
                    # Отправляем сообщение боту
                    await client.send_message(bot["username"], bot["message"])
                    print(f"Сообщение отправлено боту: {bot['message']}")

                    # Проверяем ответ от бота,кидайте ботов ,буду радовать вас скриптами
                    await asyncio.sleep(5)  # Ждем немного, чтобы бот мог ответить
                    messages = await client.get_messages(bot["username"], limit=1)
                    
                    if messages and messages[0].from_id == me.id:
                        print("Ответ от бота не получен.")
                    else:
                        print("Получен ответ от бота.")

                except FloodWaitError as e:
                    print(f"Слишком много запросов. Ожидание: {e.seconds} секунд.")
                    await asyncio.sleep(e.seconds)

                except Exception as e:
                    print(f"Ошибка при отправке сообщения: {e}")

                # Ждем заданное время перед следующим отправлением если будете ставить на без хостинга то при закрытии время сбросится
                await asyncio.sleep(bot["delay"])  # Задержка для текущего бота

if __name__ == '__main__':
    asyncio.run(main())
